monsantoDocs/Farm-manager-list-request_NOT_USED.xml

<soapenv:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:urn="urn:aggateway:names:ws:docexchange" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
   <soapenv:Header>
      <wsse:Security soapenv:mustUnderstand="1" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:soapenv="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
         <wsse:UsernameToken xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
            <wsse:Username>3350963</wsse:Username>
            <wsse:Password soapenv:Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">USITsup$3</wsse:Password>
         </wsse:UsernameToken>
      </wsse:Security>
   </soapenv:Header>
   <soapenv:Body>
      <ns1:FarmManagerListRequest Version="1.0" xmlns:cidx="urn:cidx:names:specification:ces:schema:all:4:0" xmlns:ecms="urn:ecms:schema:fmlist:request:1:0" xmlns:ns1="urn:ecms:schema:fmlist:request:1:0">
         <cidx:Header>
            <cidx:ThisDocumentIdentifier>
               <cidx:DocumentIdentifier>FM-Test1</cidx:DocumentIdentifier>
            </cidx:ThisDocumentIdentifier>
            <cidx:ThisDocumentDateTime>
               <cidx:DateTime DateTimeQualifier="On">2019-06-11T03:50:43Z</cidx:DateTime>
            </cidx:ThisDocumentDateTime>
            <cidx:From>
               <cidx:PartnerInformation>
                  <cidx:PartnerName>SHAWN SULLIVAN SEED</cidx:PartnerName>
                  <cidx:PartnerIdentifier Agency="AGIIS-EBID">1100032937530</cidx:PartnerIdentifier>
                  <cidx:ContactInformation>
                     <cidx:ContactName>WS-XML</cidx:ContactName>
                     <cidx:ContactDescription>DataSource</cidx:ContactDescription>
                  </cidx:ContactInformation>
                  <cidx:ContactInformation>
                     <cidx:ContactName>2019</cidx:ContactName>
                     <cidx:ContactDescription>SeedYear</cidx:ContactDescription>
                  </cidx:ContactInformation>
                  <cidx:ContactInformation>
                     <cidx:ContactName>AgriDealer</cidx:ContactName>
                     <cidx:ContactDescription>SoftwareName</cidx:ContactDescription>
                  </cidx:ContactInformation>
                  <cidx:ContactInformation>
                     <cidx:ContactName>1.0.0</cidx:ContactName>
                     <cidx:ContactDescription>SoftwareVersion</cidx:ContactDescription>
                  </cidx:ContactInformation>
               </cidx:PartnerInformation>
            </cidx:From>
            <cidx:To>
               <cidx:PartnerInformation>
                  <cidx:PartnerName>Monsanto Company</cidx:PartnerName>
                  <cidx:PartnerIdentifier Agency="AGIIS-EBID">0062668030000</cidx:PartnerIdentifier>
               </cidx:PartnerInformation>
            </cidx:To>
         </cidx:Header>
      </ns1:FarmManagerListRequest>
   </soapenv:Body>
</soapenv:Envelope>